#!/bin/bash

cat <<'EOF'

 ██████████                        █████   ████  ███   █████   
░░███░░░░███                      ░░███   ███░  ░░░   ░░███    
 ░███   ░░███  ██████  █████ █████ ░███  ███    ████  ███████  
 ░███    ░███ ███░░███░░███ ░░███  ░███████    ░░███ ░░░███░   
 ░███    ░███░███████  ░███  ░███  ░███░░███    ░███   ░███    
 ░███    ███ ░███░░░   ░░███ ███   ░███ ░░███   ░███   ░███ ███
 ██████████  ░░██████   ░░█████    █████ ░░████ █████  ░░█████ 
░░░░░░░░░░    ░░░░░░     ░░░░░    ░░░░░   ░░░░ ░░░░░    ░░░░░  

EOF
echo "Hi $(whoami) 🚀"
echo 
                                                             

if [ -f "${DIRNAME}/.env" ]; then
  set -a
  source "${DIRNAME}/.env"
  set +a
fi

source ${DEVKIT_DIR}/shell/alias/alias.sh
source ${DEVKIT_DIR}/shell/functions/devkit-aliases.sh

echo ""
echo "Successfully loaded DevKit ✅"
echo ""